FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_Serial.c
/*-------------------------------------------------------------------------*
 * File:  RX63N_Serial.c
 *-------------------------------------------------------------------------*
 * Description:
 *      Renesas RX63N Serial Communications Interface (SCIa)
 * Implementation:
 *      Six serial interfaces are provided here.
 *      Buffers/Queues are not stored here but handled
 *      by the layer above.  Only callback functions from within
 *      the IRQ are provided.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <HAL/HAL.h>
#include <HAL/Serial.h>
#include <HAL/Interrupt.h>
#include <uEZProcessor.h>
#include "RX63N_UtilityFuncs.h"
#include "RX63N_Serial.h"

// TBD:  not here!
#include <uEZRTOS.h>

#if (COMPILER_TYPE==RenesasRX)
typedef volatile struct st_sci0 __evenaccess T_RX63N_SCI;
#endif

/*---------------------------------------------------------------------------*
 * Constants and Macros:
 *---------------------------------------------------------------------------*/
#define BAUD_DIVIDER(b)         (((PCLK_FREQUENCY/1)/((b)*32))-1)

#define MSTP_B	0
#define MSTP_C	1

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
// Entry of SCI_ port settings
typedef struct {
    TUInt32 iInterruptChannel_RX;
    TUInt32 iInterruptChannel_TX;
    T_irqPriority iPriority;
    T_RX63N_SCI *iSCIRegs;
    TISRFPtr iISR_RX;
    TISRFPtr iISR_TX;
    TUInt16 iMSTPBit;
	TUInt8 iMSTP;
} T_Serial_RX63N_Info;

typedef struct {
    const HAL_Serial *iHAL;
    const T_Serial_RX63N_Info *iInfo;
    HAL_Serial_Callback_Transmit_Empty iTransmitEmptyFunc;
    HAL_Serial_Callback_Received_Byte iReceivedByteFunc;
    void *iCallbackWorkspace;
    T_Serial_Settings iSettings;
} T_Serial_RX63N_Workspace;

/*---------------------------------------------------------------------------*
 * Function Prototypes:
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI0_RX);
IRQ_ROUTINE(Serial_SCI0_TX);

IRQ_ROUTINE(Serial_SCI1_RX);
IRQ_ROUTINE(Serial_SCI1_TX);

IRQ_ROUTINE(Serial_SCI2_RX);
IRQ_ROUTINE(Serial_SCI2_TX);

IRQ_ROUTINE(Serial_SCI3_RX);
IRQ_ROUTINE(Serial_SCI3_TX);

IRQ_ROUTINE(Serial_SCI4_RX);
IRQ_ROUTINE(Serial_SCI4_TX);

IRQ_ROUTINE(Serial_SCI5_RX);
IRQ_ROUTINE(Serial_SCI5_TX);

IRQ_ROUTINE(Serial_SCI6_RX);
IRQ_ROUTINE(Serial_SCI6_TX);

IRQ_ROUTINE(Serial_SCI7_RX);
IRQ_ROUTINE(Serial_SCI7_TX);

IRQ_ROUTINE(Serial_SCI8_RX);
IRQ_ROUTINE(Serial_SCI8_TX);

IRQ_ROUTINE(Serial_SCI9_RX);
IRQ_ROUTINE(Serial_SCI9_TX);

IRQ_ROUTINE(Serial_SCI10_RX);
IRQ_ROUTINE(Serial_SCI10_TX);

IRQ_ROUTINE(Serial_SCI11_RX);
IRQ_ROUTINE(Serial_SCI11_TX);

IRQ_ROUTINE(Serial_SCI12_RX);
IRQ_ROUTINE(Serial_SCI12_TX);

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/

T_Serial_RX63N_Workspace *G_Serial0Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI0_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI0_Info;

T_Serial_RX63N_Workspace *G_Serial1Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI1_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI1_Info;

T_Serial_RX63N_Workspace *G_Serial2Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI2_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI2_Info;

T_Serial_RX63N_Workspace *G_Serial3Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI3_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI3_Info;

T_Serial_RX63N_Workspace *G_Serial4Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI4_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI4_Info;

T_Serial_RX63N_Workspace *G_Serial5Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI5_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI5_Info;

T_Serial_RX63N_Workspace *G_Serial6Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI6_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI6_Info;

T_Serial_RX63N_Workspace *G_Serial7Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI7_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI7_Info;

T_Serial_RX63N_Workspace *G_Serial8Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI8_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI8_Info;

T_Serial_RX63N_Workspace *G_Serial9Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI9_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI9_Info;

T_Serial_RX63N_Workspace *G_Serial10Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI10_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI10_Info;

T_Serial_RX63N_Workspace *G_Serial11Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI11_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI11_Info;

T_Serial_RX63N_Workspace *G_Serial12Workspace=0;
extern const HAL_Serial Serial_RX63N_SCI12_Interface;
extern const T_Serial_RX63N_Info G_RX63N_Serial_SCI12_Info;


/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_ProcessInterrupt_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the serial ports receive
 *      interrupts.
 *      NOTE:  This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_SCI_PortEntry *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void RX63N_Serial_ProcessInterrupt_RX(T_Serial_RX63N_Workspace *p)
{
    // We have received 1 or more bytes.  Please do
    // something with this received byte
    p->iReceivedByteFunc(
        p->iCallbackWorkspace,
        p->iInfo->iSCIRegs->RDR);
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the serial ports transmit
 *      interrupts.
 *      NOTE:  This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_SCI_PortEntry *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void RX63N_Serial_ProcessInterrupt_TX(T_Serial_RX63N_Workspace *p)
{
    // Just ran out of bytes, please transmit more (1 byte for now)
    // (or we stop here)
    p->iTransmitEmptyFunc(p->iCallbackWorkspace, 1);
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI0_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial0 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI0_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial0Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI0_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial0Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI1_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial1 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI1_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial1Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI1_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial1Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI2_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial2 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI2_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial2Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI2_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial2Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI3_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial3 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI3_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial3Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI3_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial3Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI4_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial4 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI4_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial4Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI4_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial4Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI5_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial5 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI5_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial5Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI5_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial5Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI6_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial6 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI6_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial6Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI6_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial6Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI7_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial7 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI7_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial7Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI7_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial7Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI8_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial9 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI8_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial8Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI8_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial8Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI9_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial9 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI9_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial9Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI9_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial9Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI10_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial10 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI10_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial10Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI10_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial10Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI11_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial11 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI11_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial11Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI11_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial11Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI12_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial12 interrupt and forward to RX63N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI12_RX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_RX(G_Serial12Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI12_TX)
{
    IRQ_START();
    RX63N_Serial_ProcessInterrupt_TX(G_Serial12Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  SCI_SendChar
 *---------------------------------------------------------------------------*
 * Description:
 *      Send a single character out the given SCI_ port.
 *      NOTE:  Does not block even if output queue is full!
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to use
 *      TUInt8 c                  -- Character to send
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_OutputByte(void *aWorkspace, TUInt8 aByte)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    p->iInfo->iSCIRegs->TDR = aByte;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  SCI_Disable
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable SCI_ processing on this port.
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to disable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_Deactivate(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;
    const T_Serial_RX63N_Info *p_info = p->iInfo;

