FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_Serial.c
    InterruptDisable(p_info->iInterruptChannel_RX);
    InterruptDisable(p_info->iInterruptChannel_TX);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  SCI_Enable
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable SCI_ processing on this port.
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_Activate(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;
    const T_Serial_RX63N_Info *p_info = p->iInfo;

    InterruptEnable(p_info->iInterruptChannel_RX);
    InterruptEnable(p_info->iInterruptChannel_TX);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI0
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial0
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI0(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial0Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI0_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI1
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial1
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI1(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial1Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI1_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI2
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial2
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI2(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial2Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI2_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI3
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial3
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI3(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial3Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI3_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI4
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial4
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI4(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial4Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI4_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI5
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial5
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI5(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial5Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI5_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI6
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial6
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI6(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial6Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI6_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI7
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial7
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI7(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial7Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI7_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI8
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial8
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI8(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial8Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI8_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI9
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial9
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI9(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial9Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI9_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI10
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial10
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI10(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial10Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI10_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI11
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial11
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI11(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    G_Serial11Workspace = p;
    p->iInfo = &G_RX63N_Serial_SCI11_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_InitializeWorkspace_SCI12
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial12
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_InitializeWorkspace_SCI12(void *aWorkspace)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

