FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_Serial.c
    // Enable sending/receive data
    p_info->iSCIRegs->SCR.BIT.TE = 1;
    p_info->iSCIRegs->SCR.BIT.RE = 1;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_GetSettings
 *---------------------------------------------------------------------------*
 * Description:
 *      Return the previously configured SCI_ port
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 *      T_SCI_Settings *aSettings -- Settings used for SCI_ port
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_GetSettings(
    void *aWorkspace,
    T_Serial_Settings *aSettings)
{
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    // Record these settings
    *aSettings = p->iSettings;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_SetHandshakingControl
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the handshaking control for this SCI_ port (if it has it)
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 *      T_SCI_HandshakingControl -- Control bits to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_SetHandshakingControl(
    void *aWorkspace,
    T_serialHandshakingControl aControl)
{
    PARAM_NOT_USED(aWorkspace); PARAM_NOT_USED(aControl);

    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_GetHandshakingStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the handshaking control for this SCI_ port (if it has it)
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 *      T_SCI_HandshakingStatus *aStatus -- Current status
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_Serial_GetHandshakingStatus(
    void *aWorkspace,
    T_serialHandshakingStatus *aStatus)
{
    PARAM_NOT_USED(aWorkspace); PARAM_NOT_USED(aStatus);

    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_Serial_GetStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Return the status of the port
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 * Outputs:
 *      T_SCI_StatusByte          -- Status byte returned
 *---------------------------------------------------------------------------*/
T_serialStatusByte RX63N_Serial_GetStatus(void *aWorkspace)
{
    T_serialStatusByte status = 0;
    T_Serial_RX63N_Workspace *p = (T_Serial_RX63N_Workspace *)aWorkspace;

    // Only empty if both TEMT and THRE are empty
    if (p->iInfo->iSCIRegs->SSR.BYTE & 0x80) {
        status |= SERIAL_STATUS_TRANSMIT_EMPTY;
    } else {
        // not empty
    }

    return status;
}

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
// List of SCI_ port HAL interfaces
const HAL_Serial Serial_RX63N_SCI0_Interface = {
    "RX63N:SCI0",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI0,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI1_Interface = {
    "RX63N:SCI1",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI1,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI2_Interface = {
    "RX63N:SCI2",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI2,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI3_Interface = {
    "RX63N:SCI3",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI3,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI4_Interface = {
    "RX63N:SCI4",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI4,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI5_Interface = {
    "RX63N:SCI5",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI5,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI6_Interface = {
    "RX63N:SCI6",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI6,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI7_Interface = {
    "RX63N:SCI7",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI7,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI8_Interface = {
    "RX63N:SCI8",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI8,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI9_Interface = {
    "RX63N:SCI9",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI9,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

