FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_Serial.c
const HAL_Serial Serial_RX63N_SCI10_Interface = {
    "RX63N:SCI10",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI10,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI11_Interface = {
    "RX63N:SCI11",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI11,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const HAL_Serial Serial_RX63N_SCI12_Interface = {
    "RX63N:SCI12",
    0x0100,
    RX63N_Serial_InitializeWorkspace_SCI12,
    sizeof(T_Serial_RX63N_Workspace),

    RX63N_Serial_Configure,
    RX63N_Serial_SetSettings,
    RX63N_Serial_GetSettings,
    RX63N_Serial_Activate,
    RX63N_Serial_Deactivate,
    RX63N_Serial_OutputByte,
    0,
    0,
    RX63N_Serial_GetStatus,
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI0_Info = {
    VECT_SCI0_RXI0,
    VECT_SCI0_TXI0,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI0,
    (TISRFPtr)Serial_SCI0_RX,
    (TISRFPtr)Serial_SCI0_TX,
    31, // MSTPB31
	MSTP_B
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI1_Info = {
    VECT_SCI1_RXI1,
    VECT_SCI1_TXI1,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI1,
    (TISRFPtr)Serial_SCI1_RX,
    (TISRFPtr)Serial_SCI1_TX,
    30, // MSTPB30
	MSTP_B
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI2_Info = {
    VECT_SCI2_RXI2,
    VECT_SCI2_TXI2,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI2,
    (TISRFPtr)Serial_SCI2_RX,
    (TISRFPtr)Serial_SCI2_TX,
    29, // MSTPB29
	MSTP_B
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI3_Info = {
    VECT_SCI3_RXI3,
    VECT_SCI3_TXI3,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI3,
    (TISRFPtr)Serial_SCI3_RX,
    (TISRFPtr)Serial_SCI3_TX,
    28, // MSTPB28
	MSTP_B
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI4_Info = {
    VECT_SCI4_RXI4,
    VECT_SCI4_TXI4,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI4,
    (TISRFPtr)Serial_SCI4_RX,
    (TISRFPtr)Serial_SCI4_TX,
    27, // MSTPB27
	MSTP_B
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI5_Info = {
    VECT_SCI5_RXI5,
    VECT_SCI5_TXI5,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI5,
    (TISRFPtr)Serial_SCI5_RX,
    (TISRFPtr)Serial_SCI5_TX,
    26, // MSTPB26
	MSTP_B
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI6_Info = {
    VECT_SCI6_RXI6,
    VECT_SCI6_TXI6,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI6,
    (TISRFPtr)Serial_SCI6_RX,
    (TISRFPtr)Serial_SCI6_TX,
    25, // MSTPB25
    MSTP_B
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI7_Info = {
    VECT_SCI7_RXI7,
    VECT_SCI7_TXI7,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI7,
    (TISRFPtr)Serial_SCI7_RX,
    (TISRFPtr)Serial_SCI7_TX,
    24, // MSTPB24
	MSTP_B
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI8_Info = {
    VECT_SCI8_RXI8,
    VECT_SCI8_TXI8,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI8,
    (TISRFPtr)Serial_SCI8_RX,
    (TISRFPtr)Serial_SCI8_TX,
    27, // MSTPC27
	MSTP_C
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI9_Info = {
    VECT_SCI9_RXI9,
    VECT_SCI9_TXI9,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI9,
    (TISRFPtr)Serial_SCI9_RX,
    (TISRFPtr)Serial_SCI9_TX,
    26, // MSTPC26
	MSTP_C
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI10_Info = {
    VECT_SCI10_RXI10,
    VECT_SCI10_TXI10,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI10,
    (TISRFPtr)Serial_SCI10_RX,
    (TISRFPtr)Serial_SCI10_TX,
    25, // MSTPC25
	MSTP_C
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI11_Info = {
    VECT_SCI11_RXI11,
    VECT_SCI11_TXI11,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI11,
    (TISRFPtr)Serial_SCI11_RX,
    (TISRFPtr)Serial_SCI11_TX,
    24, // MSTPC24
	MSTP_C
};

const T_Serial_RX63N_Info G_RX63N_Serial_SCI12_Info = {
    VECT_SCI12_RXI12,
    VECT_SCI12_TXI12,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX63N_SCI *)&SCI12,
    (TISRFPtr)Serial_SCI12_RX,
    (TISRFPtr)Serial_SCI12_TX,
    4, // MSTPB4
	MSTP_B
};

void RX63N_SCI0_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_P20, 0x0A},
            {GPIO_P32, 0x0B},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_P21, 0x0A},
            {GPIO_P33, 0x0B},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI0", (T_halInterface *)&Serial_RX63N_SCI0_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI1_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_P16, 0x0A},
            {GPIO_P26, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_P15, 0x0A},
            {GPIO_P30, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI1", (T_halInterface *)&Serial_RX63N_SCI1_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI2_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_P13, 0x0A},
            {GPIO_P50, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_P12, 0x0A},
            {GPIO_P52, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI2", (T_halInterface *)&Serial_RX63N_SCI2_Interface, 0, 0);
	
