FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_Serial.c
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI3_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_P17, 0x0B},
			{GPIO_P23, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_P16, 0x0B},
            {GPIO_P25, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI3", (T_halInterface *)&Serial_RX63N_SCI3_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI4_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_PB1, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_PB0, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI4", (T_halInterface *)&Serial_RX63N_SCI4_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI5_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_PA4, 0x0A},
			{GPIO_PC3, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_PA3, 0x0A},
			{GPIO_PA2, 0x0A},
			{GPIO_PC2, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI5", (T_halInterface *)&Serial_RX63N_SCI5_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI6_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_P00, 0x0A},
			{GPIO_P32, 0x0A},
			{GPIO_PB1, 0x0B},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_P01, 0x0A},
			{GPIO_P33, 0x0A},
			{GPIO_PB0, 0x0B},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI6", (T_halInterface *)&Serial_RX63N_SCI6_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI7_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_P90, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_P92, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI7", (T_halInterface *)&Serial_RX63N_SCI7_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI8_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_PC7, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_PC6, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI8", (T_halInterface *)&Serial_RX63N_SCI8_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI9_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_PB7, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_PB6, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI9", (T_halInterface *)&Serial_RX63N_SCI9_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI10_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_P82, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_P81, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI10", (T_halInterface *)&Serial_RX63N_SCI10_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI11_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_P77, 0x0A},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_P76, 0x0A},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI11", (T_halInterface *)&Serial_RX63N_SCI11_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

void RX63N_SCI12_Require(
	T_uezGPIOPortPin aPinTXD,
	T_uezGPIOPortPin aPinRXD)
{
	static const T_RX63N_MPC_ConfigList txdList[] = {
            {GPIO_PE1, 0x0C},
    };
    static const T_RX63N_MPC_ConfigList rxdList[] = {
            {GPIO_PE2, 0x0C},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI12", (T_halInterface *)&Serial_RX63N_SCI12_Interface, 0, 0);
	
	RX63N_MPC_ConfigPinOrNone(aPinTXD, txdList, ARRAY_COUNT(txdList));
	RX63N_MPC_ConfigPinOrNone(aPinRXD, rxdList, ARRAY_COUNT(rxdList));
}

/*-------------------------------------------------------------------------*
 * End of File:  RX63N_Serial.c
 *-------------------------------------------------------------------------*/
